apache/nuttx/arch/xtensa/src/esp32s2/esp32s2_i2c.c
  uint32_t sda_insig;         /* I2C SDA input signal index */
  uint32_t sda_outsig;        /* I2C SDA output signal index */
#ifdef CONFIG_ESP32S2_RTC_I2C
  /* Pin and timing information configuration struct for RTC I2C */

  ulp_riscv_i2c_cfg_t *rtc_i2c_cfg;
#endif
};

/* I2C Device Private Data */

struct esp32s2_i2c_priv_s
{
  const struct i2c_ops_s *ops; /* Standard I2C operations */

  uint32_t id;                 /* I2C instance */

  /* Port configuration */

  const struct esp32s2_i2c_config_s *config;
  int refs;                    /* Reference count */
  mutex_t lock;                /* Mutual exclusion mutex */

#ifndef CONFIG_I2C_POLLED
  sem_t sem_isr;               /* Interrupt wait semaphore */
  int cpuint;                  /* CPU interrupt assigned to this I2C */
#endif

  /* I2C work state (see enum esp32s2_i2cstate_e) */

  volatile enum esp32s2_i2cstate_e i2cstate;

  struct i2c_msg_s *msgv;      /* Message list */

  uint8_t msgid;               /* Current message ID */
  ssize_t bytes;               /* Processed data bytes */

  uint32_t error;              /* I2C transform error */

  bool ready_read;             /* If I2C has read data */

  uint32_t clk_freq;           /* Current I2C Clock frequency */

#ifdef CONFIG_I2C_TRACE
  /* I2C trace support */

  int tndx;                    /* Trace array index */
  clock_t start_time;          /* Time when the trace was started */

  /* The actual trace data */

  struct esp32s2_trace_s trace[CONFIG_I2C_NTRACE];
#endif
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static void i2c_init_clock(struct esp32s2_i2c_priv_s *priv,
                           uint32_t clock);
static void i2c_init(struct esp32s2_i2c_priv_s *priv);
static void i2c_deinit(struct esp32s2_i2c_priv_s *priv);
static int i2c_transfer(struct i2c_master_s *dev, struct i2c_msg_s *msgs,
                        int count);
#ifdef CONFIG_ESP32S2_RTC_I2C
static int rtc_i2c_transfer(struct i2c_master_s *dev, struct i2c_msg_s *msgs,
                            int count);
#endif
static inline void i2c_process(struct esp32s2_i2c_priv_s *priv,
                               uint32_t status);
#ifndef CONFIG_I2C_POLLED
static int i2c_sem_waitdone(struct esp32s2_i2c_priv_s *priv);
#endif
#ifdef CONFIG_I2C_POLLED
static int i2c_polling_waitdone(struct esp32s2_i2c_priv_s *priv);
#endif
static void i2c_clear_bus(struct esp32s2_i2c_priv_s *priv);
static void i2c_reset_fsmc(struct esp32s2_i2c_priv_s *priv);
#ifdef CONFIG_I2C_RESET
static int i2c_reset(struct i2c_master_s *dev);
#endif

#ifdef CONFIG_I2C_TRACE
static void i2c_tracereset(struct esp32s2_i2c_priv_s *priv);
static void i2c_tracenew(struct esp32s2_i2c_priv_s *priv, uint32_t status);
static void i2c_traceevent(struct esp32s2_i2c_priv_s *priv,
                           enum esp32s2_trace_e event,
                           uint32_t parm,
                           uint32_t status);
static void i2c_tracedump(struct esp32s2_i2c_priv_s *priv);
#endif /* CONFIG_I2C_TRACE */

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* I2C interface */

static const struct i2c_ops_s g_esp32s2_i2c_ops =
{
  .transfer = i2c_transfer
#ifdef CONFIG_I2C_RESET
  , .reset  = i2c_reset
#endif
};

#ifdef CONFIG_ESP32S2_RTC_I2C
static const struct i2c_ops_s g_esp32s2_rtc_i2c_ops =
{
  .transfer = rtc_i2c_transfer,
};
#endif

/* I2C device structures */

#ifdef CONFIG_ESP32S2_I2C0
static const struct esp32s2_i2c_config_s g_esp32s2_i2c0_config =
{
  .clk_freq   = I2C_CLK_FREQ_DEF,
  .scl_pin    = CONFIG_ESP32S2_I2C0_SCLPIN,
  .sda_pin    = CONFIG_ESP32S2_I2C0_SDAPIN,
#ifndef CONFIG_I2C_POLLED
  .periph     = ETS_I2C_EXT0_INTR_SOURCE,
  .irq        = ESP32S2_PERIPH2IRQ(ETS_I2C_EXT0_INTR_SOURCE),
#endif
  .clk_bit    = SYSTEM_I2C_EXT0_CLK_EN,
  .rst_bit    = SYSTEM_I2C_EXT0_RST,
  .scl_insig  = I2CEXT0_SCL_IN_IDX,
  .scl_outsig = I2CEXT0_SCL_OUT_IDX,
  .sda_insig  = I2CEXT0_SDA_IN_IDX,
  .sda_outsig = I2CEXT0_SDA_OUT_IDX
};

static struct esp32s2_i2c_priv_s g_esp32s2_i2c0_priv =
{
  .ops        = &g_esp32s2_i2c_ops,
  .id         = ESP32S2_I2C0,
  .config     = &g_esp32s2_i2c0_config,
  .refs       = 0,
  .lock       = NXMUTEX_INITIALIZER,
#ifndef CONFIG_I2C_POLLED
  .sem_isr    = SEM_INITIALIZER(0),
#endif
  .i2cstate   = I2CSTATE_IDLE,
  .msgv       = NULL,
  .msgid      = 0,
  .bytes      = 0,
  .ready_read = false
};
#endif /* CONFIG_ESP32S2_I2C0 */

#ifdef CONFIG_ESP32S2_I2C1
static const struct esp32s2_i2c_config_s g_esp32s2_i2c1_config =
{
  .clk_freq   = I2C_CLK_FREQ_DEF,
  .scl_pin    = CONFIG_ESP32S2_I2C1_SCLPIN,
  .sda_pin    = CONFIG_ESP32S2_I2C1_SDAPIN,
#ifndef CONFIG_I2C_POLLED
  .periph     = ETS_I2C_EXT1_INTR_SOURCE,
  .irq        = ESP32S2_PERIPH2IRQ(ETS_I2C_EXT1_INTR_SOURCE),
#endif
  .clk_bit    = SYSTEM_I2C_EXT1_CLK_EN,
  .rst_bit    = SYSTEM_I2C_EXT1_RST,
  .scl_insig  = I2CEXT1_SCL_IN_IDX,
  .scl_outsig = I2CEXT1_SCL_OUT_IDX,
  .sda_insig  = I2CEXT1_SDA_IN_IDX,
  .sda_outsig = I2CEXT1_SDA_OUT_IDX
};

static struct esp32s2_i2c_priv_s g_esp32s2_i2c1_priv =
{
  .ops        = &g_esp32s2_i2c_ops,
  .id         = ESP32S2_I2C1,
  .config     = &g_esp32s2_i2c1_config,
  .refs       = 0,
  .lock       = NXMUTEX_INITIALIZER,
#ifndef CONFIG_I2C_POLLED
  .sem_isr    = SEM_INITIALIZER(0),
#endif
  .i2cstate   = I2CSTATE_IDLE,
  .msgv       = NULL,
  .msgid      = 0,
  .bytes      = 0,
  .ready_read = false
};
#endif /* CONFIG_ESP32S2_I2C1 */

#ifdef CONFIG_ESP32S2_RTC_I2C

ulp_riscv_i2c_cfg_t rtc_i2c_cfg = ULP_RISCV_I2C_DEFAULT_CONFIG();

static const struct esp32s2_i2c_config_s g_esp32s2_rtc_i2c_config =
{
  .scl_pin     = CONFIG_ESP32S2_RTC_I2C_SCLPIN,
  .sda_pin     = CONFIG_ESP32S2_RTC_I2C_SDAPIN,
  .rtc_i2c_cfg = &rtc_i2c_cfg,
};

static struct esp32s2_i2c_priv_s g_esp32s2_rtc_i2c_priv =
{
  .ops        = &g_esp32s2_rtc_i2c_ops,
  .id         = ESP32S2_RTC_I2C,
  .config     = &g_esp32s2_rtc_i2c_config,
  .refs       = 0,
  .lock       = NXMUTEX_INITIALIZER,
  .i2cstate   = I2CSTATE_IDLE,
  .msgv       = NULL,
  .msgid      = 0,
  .bytes      = 0,
  .ready_read = false,
};
#endif /* CONFIG_ESP32S2_RTC_I2C */

/* Trace events strings */

#ifdef CONFIG_I2C_TRACE
static const char *g_trace_names[] =
{
  "NONE      ",
  "SENDADDR  ",
  "SENDBYTE  ",
  "RCVMODEEN ",
  "RCVBYTE   ",
  "STOP      ",
  "ERROR     "
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: i2c_reset_fifo
 *
 * Description:
 *   Reset I2C RX and TX hardware FIFO.
 *
 * Parameters:
 *   priv          - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

static void i2c_reset_fifo(struct esp32s2_i2c_priv_s *priv)
{
  uint32_t bits = I2C_TX_FIFO_RST | I2C_RX_FIFO_RST;

