apache/nuttx/arch/xtensa/src/esp32s2/esp32s2_i2c.c
  scl_low       = half_cycle - 1;
  putreg32(scl_low, I2C_SCL_LOW_PERIOD_REG(priv->id));

  /* By default, scl_wait_high must be less than scl_high */

  scl_high      = half_cycle / 2 + 2;
  scl_wait_high = half_cycle - scl_high;

  reg_value     = VALUE_TO_FIELD(scl_high, I2C_SCL_HIGH_PERIOD);
  reg_value    |= VALUE_TO_FIELD(scl_wait_high, I2C_SCL_WAIT_HIGH_PERIOD);
  putreg32(reg_value, I2C_SCL_HIGH_PERIOD_REG(priv->id));

  sda_hold      = half_cycle / 2;
  putreg32(sda_hold, I2C_SDA_HOLD_REG(priv->id));

  /* scl_wait_high < sda_sample <= scl_high */

  sda_sample    = half_cycle / 2 - 1;
  putreg32(sda_sample, I2C_SDA_SAMPLE_REG(priv->id));

  setup         = half_cycle;
  putreg32(setup, I2C_SCL_RSTART_SETUP_REG(priv->id));
  putreg32(setup, I2C_SCL_STOP_SETUP_REG(priv->id));

  hold          = half_cycle;
  putreg32(hold - 1, I2C_SCL_START_HOLD_REG(priv->id));
  putreg32(hold, I2C_SCL_STOP_HOLD_REG(priv->id));

  /* By default, we set the timeout value to 10 bus cycles */

  timeout       = half_cycle * 20;
  reg_value     = I2C_TIME_OUT_EN;
  reg_value    |= VALUE_TO_FIELD(timeout, I2C_TIME_OUT_VALUE);
  putreg32(reg_value, I2C_TO_REG(priv->id));

  /* Set current bus clock frequency */

  priv->clk_freq = bus_freq;
}

/****************************************************************************
 * Name: i2c_init
 *
 * Description:
 *   Initialize I2C hardware.
 *
 * Parameters:
 *   priv          - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

static void i2c_init(struct esp32s2_i2c_priv_s *priv)
{
  const struct esp32s2_i2c_config_s *config = priv->config;
  if (priv->id != ESP32S2_RTC_I2C)
    {
      esp_gpiowrite(config->scl_pin, 1);
      esp_configgpio(config->scl_pin, INPUT_PULLUP | OUTPUT_OPEN_DRAIN);
      esp_gpio_matrix_out(config->scl_pin, config->scl_outsig, 0, 0);
      esp_gpio_matrix_in(config->scl_pin, config->scl_insig, 0);

      esp_gpiowrite(config->sda_pin, 1);
      esp_configgpio(config->sda_pin, INPUT_PULLUP | OUTPUT_OPEN_DRAIN);
      esp_gpio_matrix_out(config->sda_pin, config->sda_outsig, 0, 0);
      esp_gpio_matrix_in(config->sda_pin, config->sda_insig, 0);

      /* Enable I2C hardware */

      modifyreg32(SYSTEM_PERIP_CLK_EN0_REG, 0, config->clk_bit);
      modifyreg32(SYSTEM_PERIP_RST_EN0_REG, config->rst_bit, 0);

      /* Disable I2C interrupts */

      i2c_intr_disable(priv);

      /* Initialize I2C Master */

      putreg32(I2C_MS_MODE | I2C_CLK_EN |
               I2C_SCL_FORCE_OUT | I2C_SDA_FORCE_OUT,
               I2C_CTR_REG(priv->id));

      /* Set FIFO mode */

      modifyreg32(I2C_FIFO_CONF_REG(priv->id), I2C_NONFIFO_EN, 0);

      /* Ensure I2C data mode is set to MSB */

      modifyreg32(I2C_CTR_REG(priv->id),
                  I2C_TX_LSB_FIRST | I2C_RX_LSB_FIRST, 0);

      i2c_reset_fifo(priv);

      /* Configure the hardware filter function */

      putreg32(I2C_SCL_FILTER_EN |
                VALUE_TO_FIELD(I2C_FILTER_CYC_NUM_DEF, I2C_SCL_FILTER_THRES),
              I2C_SCL_FILTER_CFG_REG(priv->id));
      putreg32(I2C_SDA_FILTER_EN |
                VALUE_TO_FIELD(I2C_FILTER_CYC_NUM_DEF, I2C_SDA_FILTER_THRES),
              I2C_SDA_FILTER_CFG_REG(priv->id));

      /* Set I2C source clock */

      modifyreg32(I2C_CTR_REG(priv->id), 0, I2C_REF_ALWAYS_ON);

      /* Configure I2C bus frequency */

      i2c_init_clock(priv, config->clk_freq);
    }
#ifdef CONFIG_ESP32S2_RTC_I2C
  else
    {
      priv->config->rtc_i2c_cfg->i2c_pin_cfg.scl_io_num = config->scl_pin;
      priv->config->rtc_i2c_cfg->i2c_pin_cfg.sda_io_num = config->sda_pin;
      ulp_riscv_i2c_master_init(priv->config->rtc_i2c_cfg);
    }
#endif
}

/****************************************************************************
 * Name: i2c_deinit
 *
 * Description:
 *   Disable I2C hardware.
 *
 * Parameters:
 *   priv          - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

static void i2c_deinit(struct esp32s2_i2c_priv_s *priv)
{
  const struct esp32s2_i2c_config_s *config = priv->config;

  priv->clk_freq = 0;

  modifyreg32(SYSTEM_PERIP_RST_EN0_REG, 0, config->rst_bit);
  modifyreg32(SYSTEM_PERIP_CLK_EN0_REG, config->clk_bit, 0);
}

/****************************************************************************
 * Name: i2c_reset_fsmc
 *
 * Description:
 *   Reset I2C hardware state machine and registers.
 *
 * Parameters:
 *   priv          - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

static void i2c_reset_fsmc(struct esp32s2_i2c_priv_s *priv)
{
  /* Reset FSM machine */

  modifyreg32(I2C_CTR_REG(priv->id), 0, I2C_FSM_RST);

  i2c_clear_bus(priv);
}

/****************************************************************************
 * Name: i2c_sem_waitdone
 *
 * Description:
 *   Wait for a transfer to complete.
 *
 * Parameters:
 *   priv          - Pointer to the internal driver state structure.
 *
 * Returned Value:
 *   Zero (OK) is returned on success. A negated errno value is returned on
 *   failure.
 *
 ****************************************************************************/

#ifndef CONFIG_I2C_POLLED
static int i2c_sem_waitdone(struct esp32s2_i2c_priv_s *priv)
{
  /* Wait on ISR semaphore */

  return nxsem_tickwait_uninterruptible(&priv->sem_isr,
                                        ESP32S2_I2CTIMEOTICKS);
}
#endif

/****************************************************************************
 * Name: i2c_polling_waitdone
 *
 * Description:
 *   Wait for a transfer to complete by polling status interrupt registers,
 *   which indicates the status of the I2C operations. This function is only
 *   used in polling driven mode.
 *
 * Parameters:
 *   priv          - Pointer to the internal driver state structure.
 *
 * Returned Values:
 *   Zero (OK) is returned on successful transfer. -ETIMEDOUT is returned
 *   in case a transfer didn't finish within the timeout interval. And ERROR
 *   is returned in case of any I2C error during the transfer has happened.
 *
 ****************************************************************************/

#ifdef CONFIG_I2C_POLLED
static int i2c_polling_waitdone(struct esp32s2_i2c_priv_s *priv)
{
  int ret;
  clock_t current;
  clock_t timeout;
  uint32_t status = 0;

  /* Get the current absolute time and add an offset as timeout.
   * Preferable to use monotonic, so in case the time changes,
   * the time reference is kept, i.e., current time can't jump
   * forward and backwards.
   */

  current = clock_systime_ticks();
  timeout = current + SEC2TICK(10);

