apache/nuttx/arch/xtensa/src/esp32s2/esp32s2_i2c.c
  /* Loop while a transfer is in progress
   * and an error didn't occur within the timeout
   */

  while ((current < timeout) && (priv->error == 0))
    {
      /* Check if any interrupt triggered, clear them
       * process the operation.
       */

      status = getreg32(I2C_INT_STATUS_REG(priv->id));
      if (status != 0)
        {
          /* Check if the stop operation ended. Don't use
           * I2CSTATE_FINISH, because it is set before the stop
           * signal really ends. This works for interrupts because
           * the i2c_state is checked in the next interrupt when
           * stop signal has concluded. This is not the case of
           * polling.
           */

          if ((status & I2C_TRANS_COMPLETE_INT_ST) != 0)
            {
              putreg32(status, I2C_INT_CLR_REG(priv->id));
              break;
            }

          putreg32(status, I2C_INT_CLR_REG(priv->id));
          i2c_process(priv, status);
        }

      /* Update current time */

      current = clock_systime_ticks();
    }

  /* Return a negated value in case of timeout, and in the other scenarios
   * return a positive value.
   * The transfer function will check the status of priv to check the other
   * scenarios.
   */

  if (current >= timeout)
    {
      ret = -ETIMEDOUT;
    }
  else if (priv->error != 0)
    {
      ret = ERROR;
    }
  else
    {
      ret = OK;
    }

  /* Disable all interrupts */

  i2c_intr_disable(priv);

  return ret;
}
#endif

/****************************************************************************
 * Device Driver Operations
 ****************************************************************************/

#ifdef CONFIG_ESP32S2_RTC_I2C
/****************************************************************************
 * Name: rtc_i2c_transfer
 *
 * Description:
 *   I2C transfer function for RTC I2C.
 *
 * Parameters:
 *   dev           - Device-specific state data
 *   msgs          - A pointer to a set of message descriptors
 *   count         - The number of transfers to perform
 *
 * Returned Value:
 *   Zero (OK) is returned on success. A negated errno value is returned on
 *   failure.
 *
 ****************************************************************************/

static int rtc_i2c_transfer(struct i2c_master_s *dev, struct i2c_msg_s *msgs,
                            int count)
{
  int ret = OK;
  struct esp32s2_i2c_priv_s *priv = (struct esp32s2_i2c_priv_s *)dev;

  DEBUGASSERT(count > 0);

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  /* If previous state is different than idle,
   * reset the FSMC to the idle state.
   */

  if (priv->i2cstate != I2CSTATE_IDLE)
    {
      i2c_reset_fsmc(priv);
      priv->i2cstate = I2CSTATE_IDLE;
    }

  /* Transfer the messages to the internal struct
   * and loop count times to make all transfers.
   */

  priv->msgv = msgs;

  ulp_riscv_i2c_master_set_slave_addr(msgs[0].addr);

  /* This is a limitation for RTC I2C. Each transaction has to include
   * a sub address
   */

  if (msgs[0].flags & I2C_M_NOSTOP)
    {
      ulp_riscv_i2c_master_set_slave_reg_addr(msgs[0].buffer[0]);
    }
  else
    {
      ulp_riscv_i2c_master_set_slave_reg_addr(0);
    }

  for (int i = 0; i < count; i++)
    {
      priv->bytes      = 0;
      priv->msgid      = i;
      priv->ready_read = false;
      priv->error      = 0;
      priv->i2cstate   = I2CSTATE_PROC;

      if ((msgs[i].flags & I2C_M_READ) != 0)
        {
          ulp_riscv_i2c_master_read_from_device(msgs[i].buffer, 1);
        }
      else
        {
          ulp_riscv_i2c_master_write_to_device(msgs[i].buffer,
                                               msgs[i].length);
        }
    }

  priv->i2cstate = I2CSTATE_IDLE;

  /* Dump the trace result */

  i2c_tracedump(priv);
  nxmutex_unlock(&priv->lock);

  return ret;
}
#endif

/****************************************************************************
 * Name: i2c_transfer
 *
 * Description:
 *   Generic I2C transfer function.
 *
 * Parameters:
 *   dev           - Device-specific state data
 *   msgs          - A pointer to a set of message descriptors
 *   count         - The number of transfers to perform
 *
 * Returned Value:
 *   Zero (OK) is returned on success. A negated errno value is returned on
 *   failure.
 *
 ****************************************************************************/

static int i2c_transfer(struct i2c_master_s *dev, struct i2c_msg_s *msgs,
                        int count)
{
  int ret = OK;
  struct esp32s2_i2c_priv_s *priv = (struct esp32s2_i2c_priv_s *)dev;

  DEBUGASSERT(count > 0);

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  /* If previous state is different than idle,
   * reset the FSMC to the idle state.
   */

  if (priv->i2cstate != I2CSTATE_IDLE)
    {
      i2c_reset_fsmc(priv);
      priv->i2cstate = I2CSTATE_IDLE;
    }

  /* Transfer the messages to the internal struct
   * and loop count times to make all transfers.
   */

  priv->msgv = msgs;

  for (int i = 0; i < count; i++)
    {
      /* Clear TX and RX FIFOs. */

      i2c_reset_fifo(priv);

      priv->bytes      = 0;
      priv->msgid      = i;
      priv->ready_read = false;
      priv->error      = 0;
      priv->i2cstate   = I2CSTATE_PROC;

      /* Set the SCLK frequency for the current msg. */

      i2c_init_clock(priv, msgs[i].frequency);

      if ((msgs[i].flags & I2C_M_NOSTART) != 0)
        {
          i2c_traceevent(priv, I2CEVENT_SENDBYTE, priv->bytes,
                         getreg32(I2C_SR_REG(priv->id)));
          i2c_senddata(priv);

          if (priv->bytes == msgs[i].length)
            {
              if ((msgs[i].flags & I2C_M_NOSTOP) == 0)
                {
                  priv->i2cstate = I2CSTATE_STOP;
                }
#ifndef CONFIG_I2C_POLLED
              else
                {
                  priv->i2cstate = I2CSTATE_FINISH;
                }
#endif
            }
        }
      else
        {
          /* Reset I2C trace logic */

          i2c_tracereset(priv);

          i2c_traceevent(priv, I2CEVENT_SENDADDR, msgs[i].addr,
                         getreg32(I2C_SR_REG(priv->id)));

