apache/nuttx/arch/xtensa/src/esp32s2/esp32s2_i2c.c
      trace->event = event;
      trace->parm  = parm;

      /* Bump up the trace index (unless we are out of trace entries) */

      if (priv->tndx >= (CONFIG_I2C_NTRACE - 1))
        {
          i2cerr("ERROR: Trace table overflow\n");
          return;
        }

      priv->tndx++;
      i2c_traceclear(priv);
    }
}
#endif /* CONFIG_I2C_TRACE */

/****************************************************************************
 * Name: i2c_tracedump
 *
 * Description:
 *   Dump the trace results.
 *
 * Parameters:
 *   priv          - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

#ifdef CONFIG_I2C_TRACE
static void i2c_tracedump(struct esp32s2_i2c_priv_s *priv)
{
  syslog(LOG_DEBUG, "Elapsed time: %" PRId64 "\n",
         clock_systime_ticks() - priv->start_time);

  for (int i = 0; i < priv->tndx; i++)
    {
      struct esp32s2_trace_s *trace = &priv->trace[i];
      syslog(LOG_DEBUG,
             "%2d. STATUS: %08" PRIx32 " COUNT: %3" PRIu32 " EVENT: %s(%2d)"
             " PARM: %08" PRIx32 " TIME: %" PRId64 "\n",
             i + 1, trace->status, trace->count, g_trace_names[trace->event],
             trace->event, trace->parm, trace->time - priv->start_time);
    }
}
#endif /* CONFIG_I2C_TRACE */

/****************************************************************************
 * Name: i2c_irq
 *
 * Description:
 *   This is the common I2C interrupt handler. It will be invoked when an
 *   interrupt is received on the device.
 *
 * Parameters:
 *   cpuint        - CPU interrupt index
 *   context       - Context data from the ISR
 *   arg           - Opaque pointer to the internal driver state structure.
 *
 * Returned Value:
 *   Zero (OK) is returned on success. A negated errno value is returned on
 *   failure.
 *
 ****************************************************************************/

#ifndef CONFIG_I2C_POLLED
static int i2c_irq(int cpuint, void *context, void *arg)
{
  struct esp32s2_i2c_priv_s *priv = (struct esp32s2_i2c_priv_s *)arg;

  /* Get the interrupt status and clear the interrupts that
   * triggered.
   */

  uint32_t irq_status = getreg32(I2C_INT_STATUS_REG(priv->id));
  putreg32(irq_status, I2C_INT_CLR_REG(priv->id));

  i2c_process(priv, irq_status);

  return OK;
}
#endif

/****************************************************************************
 * Name: i2c_process
 *
 * Description:
 *   This routine manages the transfer. It's called after some specific
 *   commands from the I2C controller are executed or in case of errors.
 *   It's responsible for writing/reading operations and transferring data
 *   from/to FIFO.
 *   It's called in the interrupt and polled driven mode.
 *
 * Parameters:
 *   priv          - Pointer to the internal driver state structure.
 *   status        - The current interrupt status register.
 *
 ****************************************************************************/

static void i2c_process(struct esp32s2_i2c_priv_s *priv, uint32_t status)
{
  struct i2c_msg_s *msg = &priv->msgv[priv->msgid];

  /* Check for any errors */

  if ((I2C_INT_ERR_MASK & status) != 0)
    {
      /* Save the errors, register the error event, disable interrupts
       * and release the semaphore to conclude the transfer.
       */

      priv->error = status & I2C_INT_ERR_MASK;
      priv->i2cstate = I2CSTATE_ERROR;
      i2c_traceevent(priv, I2CEVENT_ERROR, priv->error,
                     getreg32(I2C_SR_REG(priv->id)));
      i2c_intr_disable(priv);
#ifndef CONFIG_I2C_POLLED
      nxsem_post(&priv->sem_isr);
#endif
    }
  else /* If no error */
    {
      /* If a transfer has just initialized */

      if (priv->i2cstate == I2CSTATE_PROC)
        {
          /* Check the flags to perform a read or write operation */

          if ((msg->flags & I2C_M_READ) != 0)
            {
              /* RX FIFO has available data */

              if (priv->ready_read)
                {
                  i2c_traceevent(priv, I2CEVENT_RCVBYTE, priv->bytes,
                                 getreg32(I2C_SR_REG(priv->id)));
                  i2c_recvdata(priv);

                  priv->ready_read = false;
                }

              /* Received all data. Finish the transaction
               * and update the I2C state.
               */

              if (priv->bytes == msg->length)
                {
                  i2c_traceevent(priv, I2CEVENT_STOP, msg->length,
                                 getreg32(I2C_SR_REG(priv->id)));
                  i2c_sendstop(priv);
#ifndef CONFIG_I2C_POLLED
                  priv->i2cstate = I2CSTATE_FINISH;
#endif
                }
              else /* Start a receive operation */
                {
                  i2c_traceevent(priv, I2CEVENT_RCVMODEEN, 0,
                                 getreg32(I2C_SR_REG(priv->id)));
                  i2c_startrecv(priv);

                  priv->ready_read = true;
                }
            }
          else /* Write operation */
            {
              i2c_traceevent(priv, I2CEVENT_SENDBYTE, priv->bytes,
                             getreg32(I2C_SR_REG(priv->id)));
              i2c_senddata(priv);

              /* Finally sent the entire message. Update the I2C state to
               * send a stop signal in the next interrupt.
               */

              if (priv->bytes == msg->length)
                {
                  if ((msg->flags & I2C_M_NOSTOP) == 0)
                    {
                      priv->i2cstate = I2CSTATE_STOP;
                    }
#ifndef CONFIG_I2C_POLLED
                  else
                    {
                      priv->i2cstate = I2CSTATE_FINISH;
                    }
#endif
                }
            }
        }
      else if (priv->i2cstate == I2CSTATE_STOP)
        {
          /* Transmitted all data. Finish the transaction sending a stop
           * and update the I2C state.
           */

          i2c_traceevent(priv, I2CEVENT_STOP, msg->length,
                         getreg32(I2C_SR_REG(priv->id)));
          i2c_sendstop(priv);
#ifndef CONFIG_I2C_POLLED
          priv->i2cstate = I2CSTATE_FINISH;
#endif
        }
#ifndef CONFIG_I2C_POLLED
      else if (priv->i2cstate == I2CSTATE_FINISH)
        {
          /* Disable all interrupts and release the semaphore */

          i2c_intr_disable(priv);
          nxsem_post(&priv->sem_isr);
        }
#endif
    }
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32s2_i2cbus_initialize
 *
 * Description:
 *   Initialize the selected I2C port. And return a pointer to an unique
 *   instance of struct i2c_master_s. This function may be called to obtain
 *   multiple instances of the interface, each of which may be set up with a
 *   different frequency and slave address.
 *
 * Parameters:
 *   port          - Port number of the I2C interface to be initialized.
 *
 * Returned Value:
 *   Pointer to valid I2C device structure is returned on success.
 *   A NULL pointer is returned on failure.
 *
 ****************************************************************************/

struct i2c_master_s *esp32s2_i2cbus_initialize(int port)
{
  struct esp32s2_i2c_priv_s *priv;
#ifndef CONFIG_I2C_POLLED
  const struct esp32s2_i2c_config_s *config;
  int ret;
#endif

  switch (port)
    {
#ifdef CONFIG_ESP32S2_I2C0
      case ESP32S2_I2C0:
        priv = &g_esp32s2_i2c0_priv;
        break;
#endif
#ifdef CONFIG_ESP32S2_I2C1
      case ESP32S2_I2C1:
        priv = &g_esp32s2_i2c1_priv;
        break;
#endif
#ifdef CONFIG_ESP32S2_RTC_I2C
      case ESP32S2_RTC_I2C:
        priv = &g_esp32s2_rtc_i2c_priv;
        break;
#endif
      default:
        return NULL;
    }

  nxmutex_lock(&priv->lock);
  if (priv->refs++ != 0)
    {
      nxmutex_unlock(&priv->lock);
      return (struct i2c_master_s *)priv;
    }

#ifndef CONFIG_I2C_POLLED
  if (priv->id != ESP32S2_RTC_I2C)
    {
      config = priv->config;

      /* Set up to receive peripheral interrupts on the current CPU */

