apache/nuttx/arch/xtensa/src/esp32s2/esp32s2_i2c.c
      priv->cpuint = esp_setup_irq(config->periph,
                                   1, ESP_IRQ_TRIGGER_LEVEL,
                                   i2c_irq, priv);
      if (priv->cpuint < 0)
        {
          /* Failed to allocate a CPU interrupt of this type */

          priv->refs--;
          nxmutex_unlock(&priv->lock);

          return NULL;
        }

      up_enable_irq(config->irq);
    }
#endif

  i2c_init(priv);
  nxmutex_unlock(&priv->lock);

  return (struct i2c_master_s *)priv;
}

/****************************************************************************
 * Name: esp32s2_i2cbus_uninitialize
 *
 * Description:
 *   De-initialize the selected I2C port and power down the device.
 *
 * Parameters:
 *   dev           - Device structure as returned by
 *                   esp32s2_i2cbus_initialize()
 *
 * Returned Value:
 *   OK is returned on success. ERROR is returned when internal reference
 *   count mismatches or dev points to invalid hardware device.
 *
 ****************************************************************************/

int esp32s2_i2cbus_uninitialize(struct i2c_master_s *dev)
{
  struct esp32s2_i2c_priv_s *priv = (struct esp32s2_i2c_priv_s *)dev;

  DEBUGASSERT(dev != NULL);

  if (priv->refs == 0)
    {
      return ERROR;
    }

  nxmutex_lock(&priv->lock);
  if (--priv->refs)
    {
      nxmutex_unlock(&priv->lock);
      return OK;
    }

  if (priv->id != ESP32S2_RTC_I2C)
    {
#ifndef CONFIG_I2C_POLLED
      up_disable_irq(priv->config->irq);
      esp_teardown_irq(priv->config->periph, priv->cpuint);
#endif

      i2c_deinit(priv);
      nxmutex_unlock(&priv->lock);
    }

  return OK;
}

#endif /* CONFIG_ESPRESSIF_I2C_PERIPH_MASTER_MODE */
